{
    "email": [
        "avinashvadivel9@gmail.com"
    ],
    "mobile": [
        "7721544183",
        "3544513657",
        "354451365760"
    ],
    "dob": [
        "1996-01- 25"
    ],
    "skills": [
        "Nivetha Thangavel",
        "Java",
        "Physics",
        "Social"
    ],
    "name": [
        "\r\nMythili S"
    ],
    "text": "\r\nMythili S \r\nCoventry, CV1 2DR avinashvadivel9@gmail.com  7721544183       avinashvadivel.com2595879-354451365760-22542500Visa Type: Tier 4 Dependent\r\nDOB: 25-01-1996\r\nEDUCATION \r\nRMK College of Engineering and Technology\r\n2013 - 2017\r\nGPA: 7.2 \/ 10.0\r\nB.E. Electronics and Communication Engineering\r\nSKILLSET \r\nNivetha Thangavel\r\nJava\r\nPhysics\r\nSocial\r\n\r\nWORK EXPERIENCE\r\nTECHNICAL CONSULTANT\r\nTEMENOS, UK | Sep 2022 – Present\r\nInstalled and configured Temenos Data Hub (TDH) on-premises and in cloud environments using technologies such as Docker and Kubernetes.\r\nConfigured TDH clusters and nodes, including network settings, security, and backup and recovery procedures.\r\nMonitored TDH performance and health using tools such as Prometheus, Grafana, and ELK stack.\r\nMaintained TDH by applying patches and upgrades, ensuring compatibility with other systems, and troubleshooting issues.\r\nDesigned, developed, and maintained data pipelines to collect, process, and transform data from various sources using technologies such as Apache Kafka, Apache NiFi, and Python.\r\nCollaborated with data scientists and business analysts to understand their data needs and helped them gain insights from the data using SQL and Tableau.\r\nProvided technical consulting to clients, helping them to design and implement data solutions that meet their specific needs.\r\nContainerized applications and services using Docker and deployed them to Kubernetes clusters.\r\nImplemented and configured monitoring and alerting using Prometheus and Grafana to ensure system availability and performance.\r\nAutomated manual operation activities using Ansible and Terraform to streamline the deployment and configuration of infrastructure and applications.\r\nSITE RELIABILITY ENGINEER - DEVOPS\r\nTEMENOS, India | Sep 2021 – Apr 2022\r\nCreated CI\/CD Pipelines in Azure DevOps environments by providing their dependencies and tasks. \r\nAlso have experience on implementing and managing continuous delivery systems and methodologies on Azure and created END-END Automation with CI Procedures using Jenkins &amp; automated Maven builds by integrating them with Continuous Integration tools Jenkins.\r\nProfessional in designing, developing and enhancing automated scripts using Python.\r\nWorked in Dynatrace, Splunk and Azure log analytics - Designing and Developing dashboards.\r\nUsed Kubernetes to orchestrate the deployment, scaling and management of Docker Containers.\r\nExperience in all phases of software development life cycle SDLC, which includes User Interaction, Business Analysis, Design, Development, Implementation, Integration, Documentation, Testing and Deployment.\r\nDATA ENGINEERING\r\nApache Hadoop, Apache Spark, Apache Kafka\r\nOracle, MySQL, PostgreSQL, Microsoft SQL Server\r\nMongoDB\r\nETL (extract, transform, load) processes, data modeling\r\nTableau, Power BI\r\nMachine learning &amp; AI\r\nEXTRA CURRICULAR\r\nAthletics Club – Lead\r\nFitness Sessions\r\nHave ideated, designed 90 days fitness event, presented to Decathlon India and bagged sponsorship for corporate level national event.\r\nINTERN PROJECTS\r\nAdaptive learning gamification\r\nAI bot for job apply procedure\r\nInfluencer analytics by  integrating real time data from social media platforms\r\nASSOCIAT\r\nCOGNIZANT, India| Feb 2021 - Sep 2021\r\nPerformed requirements gathering and design analysis for customer contact history for customer relationship management.\r\nWorked as business requirements analysts with subject matter experts to identify and understand requirements.\r\nSupported data warehouse projects with logical and physical data modeling in Oracle environment and assured accurate delivery of DDL to the development teams.\r\nDocumented the data requirements and system changes into detailed functional specifications.\r\nTook ownership of Source to Target Mapping and tracked and maintained changes.\r\nPerformed Extraction, Transformation and Loading (ETL) using Informatica power center.\r\nDesigned and implemented data profiling and data quality improvement solution to analyze, match, cleanse, and consolidate data before loading into data warehouse.\r\nExtensively used ERWin to design Logical, Physical Data Models, and Relational database and to perform forward\/reverse engineering.\r\nResponsible in designing new FACT or Dimension Tables to existing Models.\r\nCreated deployment workflows in Jenkins which includes pre release, release and Post release steps. Configured Git with Jenkins and schedule jobs using POLL SCM option.\r\nExpertise in Development of web-based applications in Java, J2EE (Servlets, JSP and JDBC), REST and Restful Web Services, SOAP, Spring Boot, Hibernate, XML, HTML, CSS; Application servers (IBM Websphere, Tomcat and Oracle Weblogic).\r\nSENIOR SYSTEMS ENGINEER \r\nINFOSYS LTD, India | Feb2018 - Feb 2021\r\nEnhanced suite of secure web applications for the clients to plan, manager and deliver insights of goods transport.\r\nDeveloped demands and supply of units for customers, managing orders, viewing the order details, automating demand based on supply of units using Java and Angular.\r\nInvolved in installing and configuring IBM Websphere server for development.\r\nExcellent skills in applying Continuous Integration, Continuous Deployment and Continuous Delivery processes &amp; tools [ Used Tools: Git, Maven, Jenkins, Apache Tomcat, Shell Scripting, Docker, etc.].\r\nPerformed root cause analysis to provide resolutions for production issues.\r\nAWARDS &amp; CERTIFICATIONS\r\nCompleted Google UX Designer Professional Certification.\r\nHave won Brand Ambassador of Infosys and Significant Contribution to Infosys award for the year 2020.\r\n",
    "filename": "resumes\/09-Avinash_Vadivel Resume DevOps.docx",
    "place": [
        "\r\nCoventry, CV1 2DR"
    ]
}